In [1]:
import numpy as np

In [2]:
import pandas as pd

In [20]:
df = pd.read_csv('title.basics.tsv', sep="\t", index_col="tconst", nrows=None)

/home/russ/git/CGC-Machine_Learning_on_AWS/.venv/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3145: DtypeWarning: Columns (5) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [23]:
df

,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
tconst,,,,,,,,
tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"

In [22]:
df_basics.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7292281 entries, tt0000001 to tt9916880
Data columns (total 8 columns):
 #   Column          Dtype
---  ------          -----
 0   titleType       object
 1   primaryTitle    object
 2   originalTitle   object
 3   isAdult         int64
 4   startYear       object
 5   endYear         object
 6   runtimeMinutes  object
 7   genres          object
dtypes: int64(1), object(7)
memory usage: 500.7+ MB

In [24]:
df_basics.shape

(7292281, 8)

In [25]:
df_basics.describe()

            isAdult
count  7.292281e+06
mean   3.284638e-02
std    2.242526e+00
min    0.000000e+00
25%    0.000000e+00
50%    0.000000e+00
75%    0.000000e+00
max    2.020000e+03

In [8]:
df.isnull().sum()

titleType         0
primaryTitle      9
originalTitle     9
isAdult           0
startYear         0
endYear           0
runtimeMinutes    0
genres            9
dtype: int64

In [9]:
df = df.replace(r'^\\N*$', np.nan, regex=True)

In [10]:
df.isnull().sum()

titleType               0
primaryTitle            9
originalTitle           9
isAdult                 0
startYear          658500
endYear           7225253
runtimeMinutes    5219521
genres             570990
dtype: int64

In [11]:
df['titleType'].unique()

array(['short', 'movie', 'tvShort', 'tvMovie', 'tvSeries', 'tvEpisode',
       'tvMiniSeries', 'tvSpecial', 'video', 'videoGame'], dtype=object)

In [12]:
df = df[df['titleType'].isin(['movie', 'tvMovie', 'tvSeries', 'tvEpisode', 'tvMiniSeries', 'tvSpecial'])]

In [13]:
df.head(2)

,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
tconst,,,,,,,,
tt0000009,movie,Miss Jerry,Miss Jerry,0,1894,NaN,45,Romance
tt0000335,movie,Soldiers of the Cross,Soldiers of the Cross,0,1900,NaN,NaN,"Biography,Drama"

In [14]:
df.startYear = pd.to_numeric(df['startYear'])

In [15]:
df = df[
    (df['startYear'] > 2010)
    &
    (df['isAdult'] == 0)
]

In [16]:
df.head(2)

,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
tconst,,,,,,,,
tt0016906,movie,Frivolinas,Frivolinas,0,2014.0,NaN,80,"Comedy,Musical"
tt0062336,movie,El Tango del Viudo y Su Espejo Deformante,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama

In [17]:
df[df['primaryTitle'] == 'Star Wars: Episode IV - A New Hope']

,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
tconst,,,,,,,,
tt10354742,tvEpisode,Star Wars: Episode IV - A New Hope,Star Wars: Episode IV - A New Hope,0,2019.0,NaN,NaN,Comedy
tt10747212,tvEpisode,Star Wars: Episode IV - A New Hope,Star Wars: Episode IV - A New Hope,0,2019.0,NaN,131,Talk-Show
tt12429606,tvEpisode,Star Wars: Episode IV - A New Hope,Star Wars: Episode IV - A New Hope,0,2017.0,NaN,21,Talk-Show
tt5289944,tvEpisode,Star Wars: Episode IV - A New Hope,Star Wars: Episode IV - A New Hope,0,2015.0,NaN,6,Documentary